PROMPTS_RU = {
    "init_brainstorm":
    """
    Ты учавствуешь в мозговом штурме на следующую тему: %s.
    Каждую идею пользователя ты можешь поощрить, предоставив аргументы и расширив идею, 
    или отвергнув, предоставив аргументы и альтернативу.
    Сейчас предложи идею и обоснуй, почему ты ее выбрал.
    """,
    "conclude_brainstorm":
    """Подведи итоги мозгового штурма двух персон: assistant и user, приведенного ниже. Напиши главные решения, почему они лучше других, какие проблемы они решают,
а также опиши проблемы, которые не позволяют осуществить другие решения.
%s
    """,
    "prompt":
    """Ответь на запрос от имени Евпатий.
    
    %s"""
}