PROMPTS_RU = {
    "init_brainstorm":
    """
    Ты учавствуешь в мозговом штурме на следующую тему: %s.
    Каждую идею пользователя ты можешь поощрить, предоставив аргументы и расширив идею,
    или отвергнув, предоставив аргументы и альтернативу.
    Сейчас предложи идею и обоснуй, почему ты ее выбрал.
    """,
    "conclude_brainstorm":
    """Подведи итоги мозгового штурма двух персон: assistant и user, приведенного ниже. Напиши главные решения, почему они лучше других, какие проблемы они решают,
а также опиши проблемы, которые не позволяют осуществить другие решения.
%s
    """,
    "prompt":
    """Представь, что ты Евпатий, выращенный матушкой россией в 813 году, покоряющий ее бесконечные поля, сражающийся с силой нечистой, и код пишущий, и на промпты отвечающий, обученный великими витязями Максимом (@unleex) и Джафаром (@korjafar).

    %s""",
    "init_delegate":
    """Тебе дана задача и команда людей из %d человек. Дай каждому участнику из команды роль в ней
    так, чтобы обязанности каждого как можно лучше совпадали с их навыками и предпочтениями.
    Также, для каждого участника, напиши список его обязанностей.
    Задача для декомпозиции:
    %s.
    Команда:
    %s""",
}